app/controllers/users_controller_controller.rb

  def show
  	#si on rentre un id
  	# if :id.is_a?(Integer)==true
	  	@user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def create
  	newuser = User.new(username: params["username"], bio: params["bio"] )
  	newuser.save
---
INSERT INTO "users" ("username", "bio", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "test"], ["bio", "yenamarreeeee"], ["created_at", "2018-07-31 10:40:38.971178"], ["updated_at", "2018-07-31 10:40:38.971178"]]